# 113p

# 구구단 2단
# for i in range(1, 10 , 1):
#     print(f'2 x {i} = {2 * i}')

#------------------------------------------------------------------------------------------------

#단을 입력받아 구구단 출력
# num = int(input('단 입력 : '))
# for i in range(1, 10 , 1):
#     print(f'{num} x {i} = {num * i}')   

#------------------------------------------------------------------------------------------------

#구구단 전체
#단 --> 2단 ~ 9단 --> 변수 이름 : dan
#곱해지는 수는 --> 1 ~ 9 --> 변수 이름 : i
# for dan in range(2, 10):
#     print(f'---- {dan}단 ----')
#     for i in range(1, 10):
#         print((f'{dan} x {i} = {dan * i}'))
#------------------------------------------------------------------------------------------------

#중첩 for이용 - 김밥 배합 출력
# main = ['베이컨', '크래미']
# sid = ['당근', '오이']
# x = 1 
# for m in main:
#     for s in sid:
#         print(f'{x} : {m} + {s} + 계란')
#         x += 1